縦結合

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

pd.set_option("display.max.rows", 5)

名前のデータフレーム１

In [3]:
df_name_1 = pd.DataFrame(
    {
        "key": [1, 2],
        "name": ["asuka", "rina"]
    }
)

名前のデータフレーム２

In [4]:
df_name_2 = pd.DataFrame(
    {
        "key": [1, 2, 3],
        "name": ["hinako", "yui", "kyouko"]
    }
)

グループのデータフレーム

In [5]:
df_group = pd.DataFrame(
    {
        "group": ["nogi", "sakura", "nogi", "sakura", "hinata"]
    }
)

In [6]:
df_name_1

   key   name
0    1  asuka
1    2   rina

In [7]:
df_name_2

   key    name
0    1  hinako
1    2     yui
2    3  kyouko

In [8]:
df_group

    group
0    nogi
1  sakura
2    nogi
3  sakura
4  hinata

good: df_name_1とdf_name_2を縦結合(ignore_indexを使用する)

In [13]:
df_name = pd.concat(
    [df_name_1, df_name_2],
    axis=0,
    ignore_index=True
    )

In [14]:
df_name

   key    name
0    1   asuka
1    2    rina
2    1  hinako
3    2     yui
4    3  kyouko

good: df_name_1とdf_name_2を縦結合(ignore_indexを使用しない)<br>
indexまで結合されてしまう

In [16]:
df_name_bad = pd.concat(
    [df_name_1, df_name_2],
    axis=0
    )

In [17]:
df_name_bad

   key    name
0    1   asuka
1    2    rina
0    1  hinako
1    2     yui
2    3  kyouko

indexは、reset_indexで解除

In [18]:
df_name_bad.reset_index(drop=True)

   key    name
0    1   asuka
1    2    rina
2    1  hinako
3    2     yui
4    3  kyouko

df_name_1とdf_name_2を縦結合(縦結合はaxisを省略可)

In [20]:
pd.concat(
    [df_name_1, df_name_2],
    ignore_index=True
    )

   key    name
0    1   asuka
1    2    rina
2    1  hinako
3    2     yui
4    3  kyouko

df_nameとdf_groupを横結合

In [23]:
df_name_group = pd.concat(
    [df_name, df_group], 
    axis=1)

In [24]:
df_name_group

   key    name   group
0    1   asuka    nogi
1    2    rina  sakura
2    1  hinako    nogi
3    2     yui  sakura
4    3  kyouko  hinata

df_name_badとdf_groupを横結合（エラー）

In [26]:
pd.concat(
    [df_name_bad, df_group],
    axis=1)

InvalidIndexError: Reindexing only valid with uniquely valued Index objects

データフレームのindexが連番になってないと予期せぬエラーが発生する！！